app/controllers/posts_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? ORDER BY "posts"."id" DESC LIMIT ?  [["author_id", 3], ["LIMIT", 1]]
---
  def show
    if params[:author_id]
      @post = Author.find(params[:author_id]).posts.find(params[:id])